// ==UserScript==
// @name         国开大学-保险学院-自动学习脚本
// @namespace    自动化脚本
// @version      0.32.2
// @description  hold the world!
// @author       凌峰

// @match        https://www.oucbx.com/OUCWEB/LEAP/Web/html/mystudy.html*

// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/courseDetails.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwVideoPlay.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwPDF.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/pdf/web/viewer.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwExercise.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwExerciseResult.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwExercisePaser.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwQa.html*
// @match        https://www.oucbx.com/OUCStudy/LEAP/STUDYWeb/WEB/html/cwExam.html*

// @require      https://cdn.bootcdn.net/ajax/libs/jquery/3.5.1/jquery.min.js
// @require      https://cdn.bootcdn.net/ajax/libs/js-cookie/latest/js.cookie.min.js

// @grant        none
// ==/UserScript==

(function() {
    'use strict';
    console.log("自动刷课脚本已启动");
    // 题库数据,如果有没有的可自行添加
    // 题库格式: 数组,
    // 单条数据格式: json,
    // 格式内容:
    // {
    // 		"question":"问题", // 问题标题
    // 		"answer":[0] // 答案,格式为数组,值为数字,选择题选项对应 A = 0, B = 1, C = 2, D = 3
    // }
    var tks = [
        {"question": "在通货膨胀条件下获取收益最大的是。", "answer": [1]},
        {"question": "商业信用是以商品形态提供的信用提供信用的一方通常是。", "answer": [1]},
        {"question": "政府对宏观经济调控难度大所对应的汇率制度是。", "answer": [0]},
        {"question": "在利率决定理论中强调投资与储蓄对利率决定作用的是。", "answer": [2]},
        {"question": "一张还有半年到期的票据面额为4000元到银行贴现得到3600元。则年贴现率为。", "answer": [1]},
        {"question": "以下选项中不属于国际信用的是。", "answer": [3]},
        {"question": "利率与资金需求之间是的相关关系高利率会资金需求。", "answer": [0]},
        {"question": "牙买加体系下的汇率制度具有多样性可以归结为三类。不属于三类中的内容。", "answer": [3]},
        {"question": "金融市场功能的发挥需要些外部条件不包括。", "answer": [2]},
        {"question": "结合我国经济金融发展和加入世界贸易组织后开放金融市场的需要中国人民银行按照战略步骤推进利率市场化。", "answer": [3]},
        {"question": "目前人民币汇率实行的是。", "answer": [1]},
        {"question": "是指金融工具的变现能力或交易对冲能力。", "answer": [1]},
        {"question": "保险市场除了具备一般金融市场的功能外还有一些特殊的功能是。", "answer": [0, 1, 2, 4]},
        {"question": "广义金融市场包括。", "answer": [0, 1, 2, 3]},
        {"question": "经过银行承兑之后的票据信用风险相对较小是一种信用等级较高的票据。", "answer": [0]},
        {"question": "在发达的金融市场上场内交易在交易规模和品种上占有主导地位。", "answer": [1]},
        {"question": "相对购买力平价是指在某一时点上两国货币之间的兑换比例取决于两国物价总水平变动率。", "answer": [1]},
        {"question": "下列行为中应缴纳契税的有。", "answer": [3]},
        {"question": "下列行为中既缴纳增值税又缴纳消费税的是。", "answer": [0]},
        {"question": "以下关于房产税纳税人和征税范围的说法正确的是。", "answer": [2]},
        {"question": "税法的调整对象是。", "answer": [3]},
        {"question": "下列项目适用17%税率征税的有。", "answer": [2]},
        {"question": "纳税人必须在缴纳有争议的税款后税务行政复议机关才能受理纳税人的复议申请这体现了税法适用原则中的。", "answer": [0]},
        {"question": "税收法律关系产生是指在税收法律关系主体之间形成权利义务关系其产生的标志是。", "answer": [3]},
        {"question": "下列关于税务规章的表述中正确的是。", "answer": [1]},
        {"question": "下列关于城市维护建设税的表述中正确的有。", "answer": [1, 2, 3]},
        {"question": "以下适用“营改增”相关免税政策的有。", "answer": [0, 1, 2, 3]},
        {"question": "下列税种中属于间接税的有。", "answer": [0, 1, 3]},
        {"question": "下列属于税收法律关系主体的有。", "answer": [0, 1, 2, 3]},
        {"question": "纳税人自产自用的应税消费品除用于连续生产应税消费品外凡用于其他方面的于移送使用时纳税。", "answer": [0]},
        {"question": "全面深化改革与被视为“鸟之两翼”“车之双轮”推动我们的事业滚滚向前。", "answer": [0]},
        {"question": "面对经济新常态要充分发挥市场在资源配置中的作用。", "answer": [2]},
        {"question": "1940年1月在一文中毛泽东同志深刻论述了中国革命的历史特点论述了革命的对象、动力、性质和前途提出了新民主主义的纲领和道路、第一次旗帜鲜明地提出了新民主主义的完整理论。", "answer": [2]},
        {"question": "党的明确提出建立社会主义市场经济体制市场经济成为中国经济发展的总引擎。", "answer": [2]},
        {"question": "习近平总书记提出以“共商、共建、”为原则的新的全球治理观。", "answer": [2]},
        {"question": "是人民军队始终保持强大的凝聚力、向心力、创造力、战斗力的根本保证。", "answer": [1]},
        {"question": "新发展理念包括创新、、绿色、开放、共享。", "answer": [3]},
        {"question": "中国共产党的领导是中国特色社会主义最主要的特征。", "answer": [1]},
        {"question": "全面从严治党是中国共产党向人民立下的军令状。十八大以来中共中央相继颁布实施了《中国共产党问责条例》《中国共产党廉洁自律准则》《中国共产党纪律处分条例》修订了《中国共产党党内监督条例》。", "answer": [0]},
        {"question": "全面依法治国基本目标是建设中国特色社会主义法治体系建设社会主义法治国家。", "answer": [1]},
        {"question": "下面关于边际成本和平均成本的说法中哪一个是正确的？", "answer": [3]},
        {"question": "何种情况下会存在供给大于需求？", "answer": [2]},
        {"question": "稀缺性的存在意味着：", "answer": [3]},
        {"question": "在垄断竞争市场上：", "answer": [1]},
        {"question": "现代市场经济中最重要的企业形式是：", "answer": [3]},
        {"question": "如果一个企业降低其商品价格后发现总收益增加这意味着该种商品的：", "answer": [2]},
        {"question": "在垄断市场上价格：", "answer": [3]},
        {"question": "短期平均成本曲线呈U型是因为", "answer": [1]},
        {"question": "现代寡头理论运用古诺模型和拐折的需求曲线来研究寡头的行为。", "answer": [1]},
        {"question": "生产可能性曲线凹向原点说明了随着一种物品生产的增加机会成本在递增。", "answer": [1]},
        {"question": "垄断市场上无论在短期还是在长期企业均必将获得超额利润。", "answer": [1]},
        {"question": "是专门向经济不发达会员国的私有企业提供贷款和投资的国际性金融组织于1956年成立总部设立在华盛顿", "answer": [1]},
        {"question": "不属于世界银行集团的机构。", "answer": [2]},
        {"question": "生产过程从生产要素的组合到产品销售的全球化称之为。", "answer": [1]},
        {"question": "经济金融化水平的差异体现了经济发展水平的差异其早期表现形式是", "answer": [0]},
        {"question": "我国出现的第一家现代商业银行是。", "answer": [1]},
        {"question": "是金融机构的传统功能其对商品交易的顺利实现和社会交易成本的节约具有重要意义。", "answer": [2]},
        {"question": "中央银行若提高存款准备金将。", "answer": [1]},
        {"question": "下列可能影响货币政策外部时滞的因素是。", "answer": [1]},
        {"question": "按照戈德史密斯的划分方法现有金融资产总值在国民财富中所占份额是指。", "answer": [1]},
        {"question": "人们手中持有的现金代表持有人对中央银行的。", "answer": [2]},
        {"question": "传统意义上的商业银行以为主要中间业务。", "answer": [2]},
        {"question": "在不兑现的信用货币制度下始终是稳定币值的重要手段既是用于国际支付的重要储备也是中央银行重要的资产业务", "answer": [2]},
        {"question": "商业银行的外部组织形式因各国政治经济制度不同而有所不同目前主要有等类型。", "answer": [0, 2, 3, 4]},
        {"question": "商业银行投资的证券主要包括政府债券和公司债券其选择的标准是。", "answer": [0, 2, 4]},
        {"question": "充分就业目标就是要消除失业或将失业率降到极低的水平。", "answer": [1]},
        {"question": "全面推进依法治国总目标是建设社会主义法治国家。", "answer": [1]},
        {"question": "我国现行宪法是。", "answer": [3]},
        {"question": "提出倡导富强、民主、文明、和谐倡导自由、平等、公正、法治倡导爱国、敬业、诚信、友善积极培育和践行社会主义核心价值观。", "answer": [1]},
        {"question": "习近平指出中国人民具有伟大的创造精神、团结精神、梦想精神和。", "answer": [1]},
        {"question": "“世界是你们的也是我们的但是归根结底是你们的。你们青年人朝气蓬勃正在兴旺的时期好像早晨八九点钟的太阳希望寄托在你们身上。”此句话出自领导人的讲话。", "answer": [1]},
        {"question": "实体法律部门包括。", "answer": [0, 1, 3]},
        {"question": "在文字处理软件中WPS和Word等属于", "answer": [2]},
        {"question": "键盘可以作为微机输入设备", "answer": [0]},
        {"question": "世界上第一台通用计算机“ENIAC”于1953年在美国宾夕法尼亚大学诞生。", "answer": [1]},
        {"question": "CPU由运算器和控制器组成", "answer": [0]},
        {"question": "Cache设置在CPU和主存储器之间提高了计算机系统的运行效率。", "answer": [0]},
        {"question": "WPS和Word等文字处理软件属于系统软件。", "answer": [1]},
        {"question": "ALU的中文名称是运算器。", "answer": [0]},
        {"question": "MS Office是操作系统。", "answer": [1]},
        {"question": "地址总线上既可传送地址信息也可传送控制信息和其他信息。", "answer": [1]},
        {"question": "在计算机硬件技术指标中度量存储器空间大小的基本单位是", "answer": [2]},
        {"question": "计算机的存储器中组成一个字节（Byte）的二进制位（bit）个数是", "answer": [1]},
        {"question": "在Word窗口中标题栏右端的“—”表示最小化按钮可将Word窗口最小化到任务栏上。", "answer": [0]},
        {"question": "在word中要想文件可以让他人浏览但不能修改可以在“工具”菜单下的“选项”中设置修改权限口令。", "answer": [0]},
        {"question": "Word 2010中自定义功能区设定在", "answer": [1]},
        {"question": "等于每行中最大字符高度两倍的行距被称为（   ）行距。", "answer": [0]},
        {"question": "在Word 2010被使用的过程中能够显示页面四角的视图方式是", "answer": [1]},
        {"question": "在word使用的过程中段落格式应用于插入点所在的段落。", "answer": [0]},
        {"question": "在Excel工作表中若已将A1单元格中的内容在A1:E1区域中跨列居中要在编辑栏修改其内容必须选定单元格A1。", "answer": [0]},
        {"question": "Office 是一种常用的办公软件是由（   ）公司开发的软件。", "answer": [1]},
        {"question": "在excel 2010中输入当前时间可按组合键Shift+；", "answer": [1]},
        {"question": "在Excel“格式”工具栏中提供了（   ）种对齐方式。", "answer": [0]},
        {"question": "要键入（   ）先导符号才能在一个单元格内输入公式。", "answer": [3]},
        {"question": "稀缺性的存在意味着：", "answer": [3]},
        {"question": "何种情况下会存在供给大于需求？", "answer": [2]},
        {"question": "下面关于边际成本和平均成本的说法中哪一个是正确的？", "answer": [3]},
        {"question": "在垄断市场上价格：", "answer": [2]},
        {"question": "生产可能性曲线凹向原点说明了随着一种物品生产的增加机会成本在递增。", "answer": [0]},
        {"question": "2003年12月31日的外汇储备量是流量。", "answer": [1]},
        {"question": "一场台风摧毁了某地区的荔枝树市场上的荔枝少了这称为供给减少。", "answer": [0]},
        {"question": "企业用自有资金进行生产是有成本的。", "answer": [0]},
        {"question": "短期边际成本曲线与短期平均成本曲线的交点就是停止营业点。", "answer": [1]},
        {"question": "边际收益等于边际成本时企业的正常利润达到最大化。", "answer": [1]},
        {"question": "最全面反映经济中物价水平变动的物价指数是：", "answer": [2]},
        {"question": "经济增长是指：", "answer": [1]},
        {"question": "引起摩擦性失业的原因：", "answer": [3]},
        {"question": "中央银行规定的银行所保持的最低准备金与存款的比率是", "answer": [3]},
        {"question": "在LM曲线不变的情况下自发总支出减少会引起：", "answer": [3]},
        {"question": "由于总需求不足而形成的失业属于", "answer": [2]},
        {"question": "居民购买住房属于投资。", "answer": [0]},
        {"question": "技术进步是实现经济增长的必要条件。", "answer": [0]},
        {"question": "货币数量论认为流通中的货币数量越多商品价格水平越低货币价值越大。", "answer": [1]},
        {"question": "企业债券的利率高于政府债券的利率。", "answer": [0]},
        {"question": "在物品市场上利率与国内生产总值成同方向变动。", "answer": [1]},
        {"question": "无论在长期或短期中都存在的失业就是自然失业。", "answer": [1]},
        {"question": "下列关于税务规章的表述中正确的是", "answer": [1]},
        {"question": "纳税人必须在缴纳有争议的税款后税务行政复议机关才能受理纳税人的复议申请这体现了税法适用原则中的", "answer": [0]},
        {"question": "税收法律关系产生是指在税收法律关系主体之间形成权利义务关系其产生的标志是", "answer": [3]},
        {"question": "下列项目适用17%税率征税的有", "answer": [2]},
        {"question": "快递收派服务属于", "answer": [3]},
        {"question": "税法的调整对象是", "answer": [3]},
        {"question": "下列行为中既缴纳增值税又缴纳消费税的是", "answer": [0]},
        {"question": "下列税种中属于间接税的有", "answer": [1, 3]},
        {"question": "下列属于税收法律关系主体的有", "answer": [1, 2, 3]},
        {"question": "税收规章是由国务院税务主管部门制定的税收部门规章。", "answer": [0]},
        {"question": "对从事生产、委托加工、进口和出口应税消费品的单位和个人都应当征收消费税。", "answer": [1]},
        {"question": "纳税人自产自用的应税消费品除用于连续生产应税消费品外凡用于其他方面的于移送使用时纳税。", "answer": [0]},
        {"question": "如有随堂练习的需完成习题并达到（  ）的通过率后才能显示已通过如果未达到指定的通过率可重复测试并查看答案解析直至通过为止。", "answer": [2]},
        {"question": "每学期期末考试前一周学院会组织专门的（  ）主要目的是让学生熟悉网络考试的系统与环境同时做各课程的期末复习。", "answer": [3]},
        {"question": "（  ）是成人教育学历中的一种。是指使用电视及互联网等传播媒体的教学模式它突破了时空的界线。", "answer": [2]},
        {"question": "（  ）是指通过网络表现的某门学科的教学内容及实施的教学活动的总和。", "answer": [0]},
        {"question": "国家开放大学学务处理功能区功能不包括：", "answer": [3]},
        {"question": "关于IE浏览器的功能下面说法正确的是（  ）。", "answer": [0]},
        {"question": "国家开放大学学生事务与教师发展中心负责规划和管理（  ）。", "answer": [1]},
        {"question": "远程接待中心的工作理念是：（  ）。", "answer": [0]},
        {"question": "保宝APP初次登录账号是身份证号码密码是（   ）。", "answer": [2]},
        {"question": "课程作业也是必修内容需完成后分数达到（   ）分以上才算测试通过。", "answer": [3]},
        {"question": "在保宝网找回密码时如果进行【忘记密码】操作之后依旧不能找回密码登录账号可以选择进行。", "answer": [3]},
        {"question": "党的十九大作出了从决胜全面建设小康社会到基本实现现代化再到全面建成社会主义现代化国家的新的战略安排。", "answer": [1]},
        {"question": "1940年1月在（   ）一文中毛泽东同志深刻论述了中国革命的历史特点论述了革命的对象、动力、性质和前途提出了新民主主义的纲领和道路、第一次旗帜鲜明地提出了新民主主义的完整理论。", "answer": [2]},
        {"question": "中国共产党的领导是中国特色社会主义最主要的特征。", "answer": [1]},
        {"question": "去库存主要是通过对房地产市场的积极调控减轻一线热门城市房价上涨压力消化三四线城市楼市积压。", "answer": [0]},
        {"question": "全面依法治国基本目标是建设中国特色社会主义法治体系建设社会主义法治国家。", "answer": [1]},
        {"question": "新发展理念包括创新、（   ）、绿色、开放、共享。", "answer": [3]},
        {"question": "“一国两制”在香港、澳门的实践取得了举世公认的成功改变了历史上但凡收复失地都要大动干戈的历史定律这是中国的一个伟大创举为国际社会解决类似问题提供了新思路新方案。", "answer": [0]},
        {"question": "（   ）是人民军队始终保持强大的凝聚力、向心力、创造力、战斗力的根本保证。", "answer": [1]},
        {"question": "习近平总书记提出以“共商、共建、（   ）”为原则的新的全球治理观。", "answer": [2]},
        {"question": "2017年10月18日中国共产党第十九次全国代表大会在人民大会堂开幕大会作出的一个重大政治判断是“中国特色社会主义进入了新时代这是我国发展新的历史方位”。下列关于“新时代”的论述不正确的是", "answer": [1]},
        {"question": "信仰是人们在实践中形成的、具有现实可能性的对未来的向往和追求。", "answer": [0]},
        {"question": "习近平指出中国人民具有伟大的创造精神、团结精神、梦想精神和。", "answer": [1]},
        {"question": "爱国主义是一个民族、一个国家在长期发展过程中逐渐形成的、赖以生存和发展的一种基本精神因此是一成不变的。", "answer": [1]},
        {"question": "提出倡导富强、民主、文明、和谐倡导自由、平等、公正、法治倡导爱国、敬业、诚信、友善积极培育和践行社会主义核心价值观。", "answer": [1]},
        {"question": "中国特色社会主义建设是社会主义核心价值观的理论来源。", "answer": [1]},
        {"question": "《中共中央关于加强社会主义精神文明建设若干问题的决议》规定了我们今天各行各业都应共同遵守的职业道德的五项基本规范即“爱岗敬业、诚实守信、办事公道、服务群众、奉献社会”。其中是社会主义职业道德的核心规范它是贯穿于全社会共同的职业道德之中的基本精神。", "answer": [0]},
        {"question": "“为人民服务”最早出自毛主席纪念张思德同志的讲话。", "answer": [0]},
        {"question": "全面推进依法治国总目标是建设社会主义法治国家。", "answer": [1]},
        {"question": "共产党领导、多党派合作共产党执政、多党派参政是中国政党制度的基本特色也是我国政治制度的一大优势。", "answer": [0]},
        {"question": "我国现行宪法是。", "answer": [3]},
        {"question": "党的十九大提出了“培养担当民族复兴大任的时代新人”的战略要求。大学生应该以为根本要求成为中国特色社会主义事业的合格建设者和可靠接班人成为走在时代前列的奋进者、开拓者、奉献者。", "answer": [3]},
        {"question": "下列关于思想道德与法律的辩证统一关系说法最恰当的是。", "answer": [0]},
        {"question": "坚持和发展中国特色社会主义既要发挥思想道德的引领和教化作用又要发挥法律的规范和强制作用。", "answer": [0]},
        {"question": "在习近平新时代中国特色社会主义阶段我们每个人选择和确立人生目的应该。", "answer": [3]},
        {"question": "影片《袁隆平口述自传》有这样一段：“如果读小学的时候老师带我们郊游去的不是那个园艺场而是真正的农村是这样又苦又脏又累又穷的地方恐怕我就不会立志学农了。”“既然选择学农了我也没觉得后悔而是坚定了学农的信心。”“看到农民这么苦我就暗下决心立志要改造农村为农民做点实事。”“小时候亲眼目睹了中国饱受日寇的欺凌我深深感到中国应该强大起来。特别是新中国诞生后觉得中国人民真的是站起来了我也要做一番事业为中国人争一口气为自己的国家做贡献这是最大的心愿。所以我感到自己肩上应该有担子。”结合影片中袁隆平先生的自述关于怎样实现人生价值创造有意义的人生以下不符合实际的一项是。", "answer": [0]},
        {"question": "《世说新语·德行》记录的《管宁割席》故事中当士大夫乘坐的华贵车辆从门前经过时管宁和华歆都像原来一样坐在席子上读书。", "answer": [1]},
        {"question": "人生目的是指人为什么活着这一人生根本问题的认识和回答。", "answer": [0]},
        {"question": "理想作为人类的一种精神现象是人类进入文明社会的产物。", "answer": [1]},
        {"question": "习近平总书记指出人无则不立国无精神则不强。", "answer": [2]},
        {"question": "《论语·雍也》载：“贤哉回也！一箪食一瓢饮在陋巷。人不堪其忧回也不改其乐。贤哉回也！”告诉我们快乐在于精神追求。", "answer": [0]},
        {"question": "做好新时代青年工作就必须引导广大青年将作为思想武器和行动指南深刻认识其历史地位、丰富内涵、精神实质和实践要求深入领会新时代坚持和发展中国特色社会主义十四条基本方略切实增强“四个意识”牢固树立“四个自信”勇做担当民族复兴大任的时代新人最大限度地实现人生价值。", "answer": [1]},
        {"question": "坚定社会主义核心价值观自信要求我们自觉以科学文化知识来引领多样化的社会思潮增强抵御错误价值观侵蚀的能力。", "answer": [1]},
        {"question": "习近平强调：“道德建设重要的是激发人们形成善良的道德意愿、道德情感培育正确的道德判断和道德责任提高道德实践能力尤其是自觉践行能力。”大学生锤炼高尚道德品格就要做到。", "answer": [2]},
        {"question": "道德决定一切、高于一切、支配一切只要道德水平高一切社会问题都可以迎刃而解。", "answer": [1]},
        {"question": "制定和认可是法律创制的主要方式。制定是指国家机关通过立法活动产生新规范。认可是国家对既存的行为规则予以承认赋予法律效力。", "answer": [0]},
        {"question": "基层群众性自治组织包括城市和农村按居民居住地区设立的居民委员会、村民委员会。", "answer": [0]},
        {"question": "新中国的第一部宪法是。", "answer": [1]},
        {"question": "习近平总书记说：“青年一代有理想、有担当国家就有前途”。", "answer": [0]},
        {"question": "人生观的主要内容包括。", "answer": [0, 1, 2]},
        {"question": "人生态度是指人们通过生活实践形成的对人生问题的一种稳定的。", "answer": [0, 2]},
        {"question": "五四精神核心内容是爱国、进步、民主、自由。", "answer": [1]},
        {"question": "在革命、建设、改革各个历史时期中国共产党坚持马克思主义基本原理同中国具体实际相结合运用马克思主义立场、观点、方法研究解决各种重大理论和实践问题不断推进马克思主义指导党和人民取得了新民主主义革命、社会主义革命和社会主义建设、改革开放的伟大成就。", "answer": [1, 2, 3]},
        {"question": "被誉为“中国航天之父”和“中国导弹之父”的人是。", "answer": [2]},
        {"question": "在当代中国社会发展离不开改革创新改革创新是社会发展的重要动力坚持改革创新是新时代的迫切要求。以下理解错误的是。", "answer": [3]},
        {"question": "在文字处理软件中WPS和Word等属于", "answer": [2]},
        {"question": "民族精神是一个民族在长期共同生活和社会实践中形成的为本民族大多数成员所认同的的总和是一个民族赖以生存和发展的精神支柱。", "answer": [0, 1, 2, 3]},
        {"question": "勤劳勇敢的中国人民培育、继承、发展起来的以爱国主义为核心的伟大民族精神是坚定中国特色社会主义的底气是中华民族风雨无阻、高歌行进的根本力量。", "answer": [0, 1, 2, 3]},
        {"question": "高举中国特色社会主义伟大旗帜以为指导深入学习贯彻党的十九大精神", "answer": [0, 1, 2, 3]},
        {"question": "培育和践行社会主义核心价值观要从小抓起、从学校抓起。坚持围绕立德树人的根本任务把社会主义核心价值观纳入国民教育总体规划", "answer": [0, 2]},
        {"question": "为什么说孔子身上具有优秀的传统美德？", "answer": [2]},
        {"question": "大自然是人类的。", "answer": [0]},
        {"question": "红军长征中为寻找出一些无毒、可以食用的野菜、野草渡过饥饿的难关需要冒着中毒的危险尝出一种能吃的野草、野菜。张思德在“尝百草”活动中总是让身边的工作人员先尝。", "answer": [1]},
        {"question": "站在新的历史起点上革命前辈们在艰苦卓绝的革命斗争中培育起来的革命精神和优良传统永远是我们在前进道路上战胜各种困难和风险、不断夺取新胜利的强大精神力量。", "answer": [0]},
        {"question": "我国现行宪法在序言中明确规定：“本宪法以法律的形式确认了中国各族人民奋斗的成果规定了国家的根本制度和根本任务是国家的根本法具有最高的法律效力。” ", "answer": [0]},
        {"question": "一些法律、法规在某些特殊情况下可以同宪法相抵触。", "answer": [1]},
        {"question": "法的基本特征包括。", "answer": [0, 1, 2, 3]},
        {"question": "中国特色社会主义法律体系已经形成并不断发展这一法律体系是以宪法为统帅还包括在宪法统帅下形成的。", "answer": [1, 3]},
        {"question": "实体法律部门包括。", "answer": [0, 1, 3]},
        {"question": "以下关于互联网金融营销的说法不正确的是", "answer": [2]},
        {"question": "我国银行的监督管理机构是", "answer": [2]},
        {"question": "以下不属于直接折扣定价策略的是", "answer": [3]},
        {"question": "以下不属于需求导向定价法的是", "answer": [3]},
        {"question": "在金融服务营销的原则中全能型银行体现了", "answer": [1]},
        {"question": "以下不属于人员促销的是", "answer": [2]},
        {"question": "间接营销渠道的缺点是", "answer": [3]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "以下属于间接营销渠道的是", "answer": [2]},
        {"question": "金融同业的合作方式有", "answer": [0, 1, 2, 3]},
        {"question": "企业开展金融营销的任务通常包括分析客户需求、开发金融产品和", "answer": [1, 2, 3]},
        {"question": "理论是以单个企业为分析单位认为影响企业营销活动效果的因素有", "answer": [0, 1]},
        {"question": "金融营销的基本特点的有", "answer": [0, 1, 2, 3]},
        {"question": "政府社团金融交易决策过程和工商企业类似但不同的是政府社团在金融交易决策过程中会更关注", "answer": [0, 1, 2, 3]},
        {"question": "4Cs理论强调面对不断变化的市场要满足顾客的需要建立关联关系企业必须建立快速反应机制提高反应速度和回应力", "answer": [0]},
        {"question": "撇脂定价是一种先高后低的价格定价方法适用于需求价格弹性小的产品", "answer": [1]},
        {"question": "营销可以简单理解为经营可获利的顾客关系", "answer": [1]},
        {"question": "我国法律法规规定从事银行、保险、证券、基金销售的人员一般应取得相应的从业资格证书才可以进行相关产品的销售", "answer": [1]},
        {"question": "以下关于客户接近策略中“第一印象”的说法错误的是", "answer": [3]},
        {"question": "一些国际知名金融企业长期致力于研究客户的金融消费心理和购买行为这体现了金融服务营销原则中的", "answer": [0]},
        {"question": "金融产品的定价目标通常不包括", "answer": [3]},
        {"question": "商业银行借贷资本一般在企业的进入", "answer": [1]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "以下关于互联网金融营销的说法不正确的是", "answer": [2]},
        {"question": "金融企业内部关系营销的作用不包括", "answer": [2]},
        {"question": "张三在某银行接受的十次服务中只要一次感觉不够好张三就得出该银行服务不好的结论。这种现象可以用“认知”因素中的哪种因素解释", "answer": [2]},
        {"question": "以下不属于金融产品导入期阶段的特征的是", "answer": [2]},
        {"question": "金融企业做个人客户市场细分时最常用的人口统计标准一般不包括", "answer": [0]},
        {"question": "一些国际知名金融企业长期致力于研究客户的金融消费心理和购买行为这体现了金融服务营销原则中的", "answer": [0]},
        {"question": "金融产品的定价目标通常不包括", "answer": [3]},
        {"question": "商业银行借贷资本一般在企业的进入", "answer": [1]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "以下关于互联网金融营销的说法不正确的是", "answer": [2]},
        {"question": "张三在某银行接受的十次服务中只要一次感觉不够好张三就得出该银行服务不好的结论。这种现象可以用“认知”因素中的哪种因素解释", "answer": [2]},
        {"question": "以下不属于金融产品导入期阶段的特征的是", "answer": [2]},
        {"question": "金融企业公共关系活动包括。", "answer": [0, 1, 2, 3]},
        {"question": "在进行金融目标市场选择时企业应该注意", "answer": [0, 1, 2, 3]},
        {"question": "从层次上看客户满意服务包括", "answer": [0, 1, 2, 3]},
        {"question": "互联网金融营销价格策略中的产品组合定价包括", "answer": [0, 1, 2]},
        {"question": "客户经理的要求包括", "answer": [0, 1, 2, 3]},
        {"question": "如果一个客户连续2次购买某一品牌的产品或服务就可以认为客户忠诚于该品牌", "answer": [0]},
        {"question": "地理标准的作用常常不明显", "answer": [0]},
        {"question": "个性化的目的是在客户心情愉悦从而提高满意度的同时确保企业从其提供的产品或服务中获利", "answer": [1]},
        {"question": "若金融产品和服务具有专门化特征那么根据金融产品特性金融企业宜采取无差异性目标市场策略", "answer": [0]},
        {"question": "企业在定价时收取一笔固定费用再加上可变的使用费这种定价方法被称为", "answer": [2]},
        {"question": "不同年龄段的人由于生活观念和工作阅历的差别对待风险和收益的态度不同需要的金融产品也不同。一般来说对于已经步入中年的人群来说他们", "answer": [1]},
        {"question": "如果某金融企业的竞争对手是一家实力雄厚、资源充足、业务发展成熟的企业而且该竞争对手采取了无差异性目标市场策略那么该金融企业适宜采用", "answer": [2]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "以下关于互联网金融营销特点的说法不正确的是", "answer": [2]},
        {"question": "金融市场细分的可操作性原则是", "answer": [3]},
        {"question": "张三在某银行接受的十次服务中只要一次感觉不够好张三就得出该银行服务不好的结论。这种现象可以用“认知”因素中的哪种因素解释", "answer": [2]},
        {"question": "以下关于互联网金融营销的说法不正确的是", "answer": [2]},
        {"question": "我国银行的监督管理机构是", "answer": [2]},
        {"question": "以下不属于直接折扣定价策略的是", "answer": [3]},
        {"question": "在金融服务营销的原则中全能型银行体现了", "answer": [1]},
        {"question": "以下不属于人员促销的是", "answer": [2]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "客户接近策略中在确定约访对象时金融企业营销人员应尽量设法直接约见客户的", "answer": [1]},
        {"question": "企业开展金融营销的任务通常包括分析客户需求、开发金融产品和", "answer": [1, 2, 3]},
        {"question": "政府社团金融交易决策过程和工商企业类似但不同的是政府社团在金融交易决策过程中会更关注", "answer": [1]},
        {"question": "撇脂定价是一种先高后低的价格定价方法适用于需求价格弹性小的产品", "answer": [1]},
        {"question": "营销可以简单理解为经营可获利的顾客关系", "answer": [1]},
        {"question": "我国法律法规规定从事银行、保险、证券、基金销售的人员一般应取得相应的从业资格证书才可以进行相关产品的销售", "answer": [1]},
        {"question": "产品系列定价是互联网保险常用的定价策略", "answer": [1]},
        {"question": "在金融服务营销的原则中全能型银行体现了", "answer": [1]},
        {"question": "金融产品在定价时通常选择“888”、“168”的数字这种定价策略属于", "answer": [2]},
        {"question": "企业在定价时收取一笔固定费用再加上可变的使用费这种定价方法被称为", "answer": [2]},
        {"question": "以下不属于金融产品导入期阶段的特征的是", "answer": [2]},
        {"question": "以下不属于直接折扣定价策略的是", "answer": [3]},
        {"question": "缘故法的特点除了被拒绝的机会小、成功机会较大外还有", "answer": [0]},
        {"question": "客户开发的缘故法是指", "answer": [3]},
        {"question": "金融产品的定价目标通常不包括", "answer": [3]},
        {"question": "在金融服务营销的原则中全能型银行体现了", "answer": [1]},
        {"question": "在金融产品定价中属于心理定价策略的有", "answer": [0, 2, 3]},
        {"question": "企业开展金融营销的任务通常包括分析客户需求、开发金融产品和", "answer": [1, 2, 3]},
        {"question": "金融服务营销的原则包括", "answer": [0, 1, 2, 3]},
        {"question": "具体而言金融企业针对员工开展的内部关系营销包括", "answer": [0, 1, 2, 3]},
        {"question": "互联网金融营销价格策略中的产品组合定价包括", "answer": [0, 1, 2]},
        {"question": "改善食堂饭菜质量和品种、完善办公自动化属于员工服务策略的具体应用", "answer": [1]},
        {"question": "银行销售信用卡属于直接营销渠道的典型应用", "answer": [0]},
        {"question": "4Cs理论强调企业应考虑客户为满足需求与愿望付出的成本、代价是多少而不是先给产品定价", "answer": [1]},
        {"question": "营销可以简单理解为经营可获利的顾客关系", "answer": [1]},
        {"question": "金融营销的客体是金融企业", "answer": [0]},
        {"question": "在金融交易决策过程中以下信息不属于商业来源的是", "answer": [3]},
        {"question": "以下关于金融产品营销渠道拓展策略的说法不正确的是", "answer": [1]},
        {"question": "一些国际知名金融企业长期致力于研究客户的金融消费心理和购买行为这体现了金融服务营销原则中的", "answer": [0]},
        {"question": "商业银行借贷资本一般在企业的进入", "answer": [1]},
        {"question": "影响金融产品定价的内部因素不包括", "answer": [2]},
        {"question": "企业在定价时收取一笔固定费用再加上可变的使用费这种定价方法被称为", "answer": [2]},
        {"question": "金融产品的定价目标通常不包括", "answer": [3]},
        {"question": "张三在某银行接受的十次服务中只要一次感觉不够好张三就得出该银行服务不好的结论。这种现象可以用“认知”因素中的哪种因素解释", "answer": [3]},
        {"question": "以下属于间接营销渠道的是", "answer": [2]},
        {"question": "在市场定位中若产品销售渠道少、市场反映差此时金融企业适于采用策略", "answer": [2]},
        {"question": "金融营销的作用有", "answer": [0, 1, 2, 3]},
        {"question": "政府社团金融交易决策过程和工商企业类似但不同的是政府社团在金融交易决策过程中会更关注", "answer": [0, 1, 2, 3]},
        {"question": "不同的文化教育与思维方式会导致不同的营销效果", "answer": [1]},
        {"question": "银行销售信用卡属于直接营销渠道的典型应用", "answer": [0]},
        {"question": "在市场细分中地理标准的作用常常不明显", "answer": [0]},
        {"question": "根据金融产品的生命周期当金融产品进入成熟期后金融企业可考虑采用差异性目标市场策略", "answer": [1]},
        {"question": "因为金融产品具有同质性特点所以金融营销一般不具有特色", "answer": [0]},
        {"question": "在市场定位中若产品销售渠道少、市场反映差此时金融企业适于采用策略", "answer": [2]},
        {"question": "影响金融产品定价的内部因素不包括", "answer": [2]},
        {"question": "如果某金融企业的竞争对手是一家实力雄厚、资源充足、业务发展成熟的企业而且该竞争对手采取了无差异性目标市场策略那么该金融企业适宜采用", "answer": [2]},
        {"question": "张三在某银行接受的十次服务中只要一次感觉不够好张三就得出该银行服务不好的结论。这种现象可以用“认知”因素中的哪种因素解释", "answer": [2]},
        {"question": "以下关于互联网金融营销的说法不正确的是", "answer": [2]},
        {"question": "以下关于金融营销宏观环境的说法不正确的是", "answer": [1]},
        {"question": "以下属于间接营销渠道的是", "answer": [2]},
        {"question": "CRM系统的实施与安装需要做到", "answer": [0, 1, 2, 3]},
        {"question": "接近客户的方法包括", "answer": [0, 1, 2, 3]},
        {"question": "在进行金融目标市场选择时企业应该注意", "answer": [0, 1, 2, 3]},
        {"question": "互联网金融营销价格策略中的产品组合定价包括", "answer": [0, 1, 2]},
        {"question": "“4Ps”理论是以单个企业为分析单位认为影响企业营销活动效果的因素有", "answer": [0, 1]},
        {"question": "4Ps 理论、4Cs 理论、4Rs 理论三者不是取代关系而是完善、发展的关系", "answer": [1]},
        {"question": "若金融产品和服务具有专门化特征那么根据金融产品特性金融企业宜采取无差异性目标市场策略", "answer": [0]},
        {"question": "缔约过失责任是指在合同订立过程中一方当事人因而导致另一方的信赖利益的损失应承担的民事责任", "answer": [2]},
        {"question": "保险合同订立是指投保人与之间基于意思一致而进行的法律行为", "answer": [0]},
        {"question": "根据不同的原因来划分无效有约定无效与", "answer": [0]},
        {"question": "自债务人的行为发生之日起没有行使撤销权的该撤销权消灭", "answer": [2]},
        {"question": "租赁合同的内容包括租赁物的、租金及其支付期限和方式、租赁物维修等条款", "answer": [0, 1, 2, 3]},
        {"question": "债务人接到债权转让通知后债务人对让与人的抗辩可以向受让人主张", "answer": [0]},
        {"question": "当事人一方经对方同意可以将自己在合同中的权利和义务一并转让给第三人", "answer": [0]},
        {"question": "当事人在订立合同过程中知悉的商业秘密无论合同是否成立不得泄露或者不正当地使用", "answer": [0]},
        {"question": "违约金是对损害赔偿额的预先约定不能高于实际损失也不能低于实际损失", "answer": [1]},
        {"question": "当事人应当遵循根据合同的性质、目的和交易习惯履行通知、协助、保密等义务", "answer": [0]},
        {"question": "合同的变更是变化的民事法律行为", "answer": [0]},
        {"question": "当事人一方不履行合同义务或者履行合同义务不符合约定的在履行义务或者采取补救措施后对方还有其他损失的", "answer": [0]},
        {"question": "办理贷款业务的金融机构贷款的利率应当按照规定的贷款利率的上下限确定", "answer": [0]},
        {"question": "保险合同解释应遵循的原则有", "answer": [0, 1, 2, 3]},
        {"question": "保险合同的解除包括", "answer": [0, 2, 3]},
        {"question": "投保人、被保险人故意制造保险事故的保险人有权解除合同但要承担赔偿或者给付保险金的责任", "answer": [1]},
        {"question": "订立合同只能采用书面形式", "answer": [1]},
        {"question": "合同生效后当事人不得因姓名、名称的变更或者法定代表人、负责人、承办人的变动而不履行合同义务", "answer": [0]},
        {"question": "当事人约定由债务人向第三人履行债务的债务人未向第三人履行债务或者履行债务不符合约定应当向债权人承担违约责任", "answer": [0]},
        {"question": "合同的变更是变化的民事法律行为", "answer": [0]},
        {"question": "以违约为前提体现了法的强制不依附于其他责任形式", "answer": [2]},
        {"question": "自债务人的行为发生之日起没有行使撤销权的该撤销权消灭", "answer": [2]},
        {"question": "保险合同生效的条件有", "answer": [0, 1, 2]},
        {"question": "精神病患者、醉酒的人通常不具有订约的法定资格未成年人具有订约的法定资格", "answer": [1]},
        {"question": "违约金是对损害赔偿额的预先约定不能高于实际损失也不能低于实际损失", "answer": [1]},
        {"question": "出卖人应当按照约定的期限交付标的物。约定交付期间的出卖人可以在该交付期间内的任何时间交付", "answer": [0]},
        {"question": "当事人协商一致可以解除合同", "answer": [0]},
        {"question": "以违约为前提体现了法的强制不依附于其他责任形式", "answer": [2]},
        {"question": "当事人一方明确表示或者以自己的行为表明不履行合同义务的对方可以在要求其承担违约责任", "answer": [0]},
        {"question": "标的物在订立合同之前已为买受人占有的合同生效的时间为", "answer": [0]},
        {"question": "建设工程的招标投标活动应当依照有关法律的规定进行", "answer": [0, 1, 2]},
        {"question": "债务人将合同的义务全部或者部分转移给第三人的应当经债权人同意", "answer": [0]},
        {"question": "自然人之间的借款合同自贷款人提供借款时生效", "answer": [0]},
        {"question": "违约金是对损害赔偿额的预先约定不能高于实际损失也不能低于实际损失", "answer": [1]},
        {"question": "撤销权人撤销赠与的可以向受赠人要求返还赠与的财产", "answer": [0]},
        {"question": "1694年在政府支持下建立成为世界上第一家以股份制形式组建的银行", "answer": [3]},
        {"question": "是按照法定比率向中央银行缴存的存款准备金", "answer": [0]},
        {"question": "是指商业银行的库存现金与在中央银行的超额准备金之和", "answer": [1]},
        {"question": "是在利率变动循环时期使银行资产负债利差最大化的一项战略措施", "answer": [2]},
        {"question": "资本的是指银行通过资本冲抵资产损失而对银行稳定经营所发挥的保护作用", "answer": [1]},
        {"question": "是指商业银行所具有的创造信用流通工具并据以扩大贷款和投资的能力", "answer": [2]},
        {"question": "是指中央银行或其他金融监管当局依据国家法律规定对整个金融业（包括金融机构和金融业务）实施的监督管理", "answer": [0]},
        {"question": "是指对银行市场营销产生直接影响的具体环境具体包括客户环境、竞争者环境和银行内部环境", "answer": [2]},
        {"question": "指商业银行所吸收的各种活期存款、定期存款和储蓄存款", "answer": [0]},
        {"question": "是指持有外汇的债权人按一定的价格将其外汇出售换取本币或是需要清偿外币的债务人按一定的价格用本币买进外币（或用一种外币兑换成另一种外币）的过程", "answer": [0]},
        {"question": "商业银行通过支付中介职能为社会经济运行发挥了以下促进作用", "answer": [0, 1, 2, 3, 4]},
        {"question": "商业银行风险存在的原因主要包括以下几点", "answer": [0, 1, 2]},
        {"question": "银行贷款的定价方法包括", "answer": [0, 1, 2, 3]},
        {"question": "常见的风险衡量方法有以下几种", "answer": [0, 1, 2, 3, 4]},
        {"question": "我国资本监管制度的三大支柱：第一支柱是针对信用风险、市场风险和操作风险的全球统一的最低资本要求", "answer": [0]},
        {"question": "所谓经济附加值又称经济利润、经济增加值是指一定时期的企业投入资本的资金成本和税后营业净利润的差额", "answer": [1]},
        {"question": "公司债券是由地方政府发行的债券所筹资金多用于地方基础设施建设和公益事业发展", "answer": [0]},
        {"question": "一次性偿还是指借款人在贷款到期日一次性还清贷款本金的贷款其利息可以分期支付也可以在归还本金时一次性付清", "answer": [0]},
        {"question": "银行存款越多对银行经营就越有利", "answer": [1]},
        {"question": "，是指银行获得利润的能力。在整个经营管理过程中，实现利润目标的最大化是商业银行经营活动的最终目标", "answer": [3]},
        {"question": "，适用于价格敏感和薄利多销的市场。其优点是可以使银行在短期内扩大市场份额，提高市场占有率；同时还可有效排斥竞争者进入市场", "answer": [2]},
        {"question": "《巴塞尔Ⅲ》提高了最低资本充足率要求。其要求：银行的一级资本充足率≥", "answer": [2]},
        {"question": "，是在延期付款的大型成套设备贸易中，出口商把经进口商承兑的（期限为6个月至10年）远期汇票，以贴现方式无追索权地售予出口商所在地的银行，提前取得现款的一种汇票贴现方式", "answer": [2]},
        {"question": "，是按照法定比率向中央银行缴存的存款准备金", "answer": [0]},
        {"question": "，是指制约和影响商业银行经营管理与发展的外部条件和各种因素", "answer": [3]},
        {"question": "是指商业银行所具有的创造信用流通工具并据以扩大贷款和投资的能力", "answer": [2]},
        {"question": "一般地，可以将市场定位的策略分为以下几种", "answer": [0, 1, 2, 3]},
        {"question": "按控制范围划分的控制类型，商业银行内部控制包括", "answer": [0, 3]},
        {"question": "竞争者环境分析包括以下三个方面的内容", "answer": [0, 1, 3]},
        {"question": "银行的支付结算方式包括", "answer": [0, 1, 2]},
        {"question": "国际商业贷款的管理因素包括", "answer": [0, 2]},
        {"question": "掉期买卖，实际上是即期买卖与远期买卖的综合，是在买进或卖出某种货币的同时，再卖出或买进同等金额的同种货币，二者的交割日相同", "answer": [1]},
        {"question": "商业银行在贷款政策中应当为自己确定一个合理的贷款规模，这是银行制订详细而周密的年度贷款计划的基础", "answer": [0]},
        {"question": "《巴塞尔Ⅲ》重新界定了监管资本的定义，按照资本吸收风险损失的能力，将其划分为两大类：一级资本和二级资本。一级资本，是指破产清算状况下吸收损失的资本", "answer": [1]},
        {"question": "票面收益率可以真正衡量投资人获得的最终受益", "answer": [1]},
        {"question": "衍生金融工具是指在传统的金融工具，如现货市场的债券和股票等基础上产生的新型交易工具，其最初目的是获取利润", "answer": [1]},
        {"question": "，是指银行获得利润的能力。在整个经营管理过程中，实现利润目标的最大化是商业银行经营活动的最终目标", "answer": [3]},
        {"question": "，是指中央银行或其他金融监管当局依据国家法律规定对整个金融业（包括金融机构和金融业务）实施的监督管理", "answer": [0]},
        {"question": "《巴塞尔Ⅲ》提高了最低资本充足率要求。其要求：银行的一级资本充足率≥", "answer": [2]},
        {"question": "，是指银行将已发放的贷款出售给其他金融机构或投资者的行为", "answer": [3]},
        {"question": "是指作为经营信用业务的企业，良好的社会形象是商业银行生存与持续发展的重要基础", "answer": [3]},
        {"question": "，一般是指市场利率变化给商业银行的资产和负债带来损失的可能性", "answer": [2]},
        {"question": "，指商业银行所吸收的各种活期存款、定期存款和储蓄存款。", "answer": [0]},
        {"question": "，是指商业银行的库存现金与在中央银行的超额准备金之和", "answer": [1]},
        {"question": "，是指银行跟随市场竞争者的定价，而不考虑其本身提供产品的成本和收入目标，以保护现有的市场占有率，如贷款的减息、存款的加息等", "answer": [1]},
        {"question": "，是指经济主体在持有或运用外汇的经济活动中，因汇率波动而蒙受损失的可能性", "answer": [3]},
        {"question": "内部经营风险是指由商业银行的( )等因素引起的风险", "answer": [0, 2, 3]},
        {"question": "商业银行证券投资可以获得的利润主要包括", "answer": [0, 2]},
        {"question": "商业银行常用的风险补偿方法有以下几种", "answer": [0, 2, 3]},
        {"question": "商业银行风险存在的原因，主要包括以下几点", "answer": [0, 1, 2]},
        {"question": "商业银行办理委托贷款业务，应当遵循依法合规、平等自愿、责利匹配、审慎经营的原则", "answer": [0]},
        {"question": "监事会是商业银行内部负责检查监督业务经营活动规范与否的常设机构", "answer": [1]},
        {"question": "银行存款越多对银行经营就越有利", "answer": [1]},
        {"question": "在早期银行业务中，贷款业务成为银行最主要的盈利渠道，并决定着银行的发展类型。", "answer": [0]},
        {"question": "，也是商业银行在遇到资金临时短缺、周转困难时筹集资金的途径之一，一般只发生在银行与银行之间", "answer": [1]},
        {"question": "，适用于刚刚投放市场的新产品", "answer": [0]},
        {"question": "是保持银行流动性、决定盈利状况的重要因素", "answer": [0]},
        {"question": "是银行进行证券投资的首要功能和目标", "answer": [1]},
        {"question": "，是指将商业银行的经营范围限定在银行业务内容，银行与其他金融机构有着明确的业务范围与界限", "answer": [2]},
        {"question": "，是指持有外汇的债权人按一定的价格将其外汇出售换取本币，或是需要清偿外币的债务人按一定的价格用本币买进外币（或用一种外币兑换成另一种外币）的过程", "answer": [0]},
        {"question": "是指商业银行所具有的创造信用流通工具并据以扩大贷款和投资的能力", "answer": [2]},
        {"question": "资本的是指银行通过资本冲抵资产损失，而对银行稳定经营所发挥的保护作用", "answer": [0]},
        {"question": "《巴塞尔Ⅲ》提高了最低资本充足率要求。其要求：银行的一级资本充足率≥", "answer": [2]},
        {"question": "是银行开展业务经营的先决条件", "answer": [0]},
        {"question": "银行贷款的定价方法包括", "answer": [0, 1, 2, 3]},
        {"question": "商业银行风险存在的原因，主要包括以下几点", "answer": [0, 1, 2]},
        {"question": "商业银行的信用分析技术，主要包括", "answer": [1, 2]},
        {"question": "普通股是指股份制商业银行所发行的、在收益分配以及资产分配方面比普通股具有优先要求权的股票", "answer": [1]},
        {"question": "单一银行制是一种既设有总行又设有分支机构的商业银行组织形式", "answer": [1]},
        {"question": "期权交易具有明显的特点：风险的不对称性，选择的灵活性，损失的有限性", "answer": [0]},
        {"question": "回购业务也称证券回购或回购协议，是指银行在出售有价证券等金融资产时与购买方签订协议，约定在一定期限后按协议价格购回所售证券", "answer": [0]},
        {"question": "从受托人角度讲，信托是委托人为收受、保存、处置自己的财产，在信任他人的基础上，委托他人按自己的要求管理和处置归己所有的财产", "answer": [1]},
        {"question": "所有者权益的来源不包括", "answer": [3]},
        {"question": "下列各项公式不正确的是", "answer": [0]},
        {"question": "甲公司与乙公司合并，乙公司合并时资产的账面价值1000000元，公允价值是1200000元；负债的账面价值400000元，公允价值400000元；股东权益的账面价值600000元。甲公司以800000元的合并对价，取得乙公司的全部股权，合并后乙公司继续保持独立法人地位。甲公司的股东权益为2000000万元。该合并是非同一控制下的企业合并，合并时确认的长期股权投资的初始投资成本是元", "answer": [1]},
        {"question": "从存货购入的不同方式及其管理要求来看，下列不能反映存货的科目有", "answer": [3]},
        {"question": "某公司一辆运输卡车原值150000元，预计总行驶里程为500000公里，预计报废时的净残值率为5%，本月行驶8000公里。采用工作量法计算的该汽车本月折旧额为", "answer": [0]},
        {"question": "某公司5月30日根据“发料凭证汇总表”的记录，本月生产产品领用甲材料50000元，车间管理部门领用甲材料2000元，企业管理部门领用甲材料1000元。应该借记制造费用元", "answer": [2]},
        {"question": "职工王明因为特殊原因经批准向单位借现金5000元的会计分录应为", "answer": [2]},
        {"question": "“收入-费用=利润”是反映的会计等式", "answer": [1]},
        {"question": "无形资产包括", "answer": [0, 1, 2, 3]},
        {"question": "增值税一般纳税人本月应缴纳的增值税额为销项税额减去进项税额的差额，缴纳增值税的会计分录涉及到的会计科目是", "answer": [0, 3]},
        {"question": "企业利润分配时，借记利润分配，贷记的会计科目可能有", "answer": [1, 2]},
        {"question": "下列属于负债类会计科目的是", "answer": [0, 1, 2, 3]},
        {"question": "企业开出的商业承兑汇票到期无力支付时，应该做一个结转的会计分录，涉及到的会计科目是", "answer": [1, 3]},
        {"question": "短期借款属于资产类科目", "answer": [1]},
        {"question": "应收账款属于负债类科目", "answer": [1]},
        {"question": "增值税的一般纳税人会计处理的要求主要是依据增值税专用发票，进行进项税额、销项税额和本期应交增值税的计算与处理", "answer": [0]},
        {"question": "账实核对。核对会计账簿记录与财产等实有数额是否相符。包括：现金日记账账面余额与现金实际库存数相核对；银行存款日记账账面余额定期与银行对账单相核对；各种财物明细账账面余额与财物实存数额核对；各种应收、应付款明细账账面余额与有关债务、债权单位或者个人核对等", "answer": [0]},
        {"question": "会计的核算职能，是指会计以货币为主要计量单位，对特定主体的经济活动进行确认、计量和报告", "answer": [0]},
        {"question": "下列各项公式不正确的是", "answer": [0]},
        {"question": "职工王明因为特殊原因经批准向单位借现金5000元的会计分录应为", "answer": [2]},
        {"question": "下面关于固定资产计价的描述不正确的是", "answer": [3]},
        {"question": "甲公司与乙公司合并，乙公司合并时资产的账面价值1000000元，公允价值是1200000元；负债的账面价值400000元，公允价值400000元；股东权益的账面价值600000元。甲公司以800000元的合并对价，取得乙公司的全部股权，合并后乙公司继续保持独立法人地位。甲公司的股东权益为2000000万元。该合并是非同一控制下的企业合并，合并时确认的长期股权投资的初始投资成本是元", "answer": [1]},
        {"question": "资产按照现在购买相同或者相似资产所需支付的现金或者现金等价物的金额计量，这种计量属性称为", "answer": [2]},
        {"question": "某公司一辆运输卡车原值150000元，预计总行驶里程为500000公里，预计报废时的净残值率为5%，本月行驶8000公里。采用工作量法计算的该汽车本月折旧额为", "answer": [0]},
        {"question": "下列各项关于固定资产折旧表述不正确的是", "answer": [2]},
        {"question": "企业利润分配时，借记利润分配，贷记的会计科目可能有", "answer": [1, 2]},
        {"question": "企业确认坏账损失的会计分录涉及到的会计科目有", "answer": [1, 2]},
        {"question": "下列属于负债类会计科目的是", "answer": [1, 2, 3,]},
        {"question": "增值税一般纳税人本月应缴纳的增值税额为销项税额减去进项税额的差额，缴纳增值税的会计分录涉及到的会计科目是", "answer": [0, 3]},
        {"question": "会计的基本职能包括", "answer": [1, 2]},
        {"question": "企业发生的支出不产生经济利益的，或者即使能够产生经济利益但不符合或者不再符合资产确认条件的，应当在发生时确认为费用，计入当期损益", "answer": [0]},
        {"question": "费用只有在经济利益很可能流出从而导致企业资产减少或者负债增加、且经济利益的流出额能够可靠计量时才能予以确认", "answer": [0]},
        {"question": "财务会计报告的目标，也简称为会计的目标，即期望会计达到的目的或境界。这也是财务会计体系的基础", "answer": [0]},
        {"question": "应收账款属于负债类科目", "answer": [1]},
        {"question": "某公司一辆运输卡车原值150000元，预计总行驶里程为500000公里，预计报废时的净残值率为5%，本月行驶8000公里。采用工作量法计算的该汽车本月折旧额为", "answer": [0]},
        {"question": "各种类型经济业务都以通用格式记录的记账凭证是", "answer": [1]},
        {"question": "在采用借贷记账法时，登记在账户贷方", "answer": [2]},
        {"question": "企业开出的商业承兑汇票到期无力支付时，应该贷记科目", "answer": [3]},
        {"question": "关于坏账准备的说法不正确的是", "answer": [2]},
        {"question": "“应收账款”账户的期初借方余额为8000元，本期借方发生额为12000元，期末借方余额为6000元，则本期贷方发生额为", "answer": [0]},
        {"question": "下列各项公式不正确的是", "answer": [0]},
        {"question": "与或有事项相关的义务同时满足下列条件的，应当确认为预计负债", "answer": [0, 1, 2]},
        {"question": "企业计提固定资产折旧时可能涉及到的会计科目有", "answer": [0, 1, 2, 3]},
        {"question": "关于杜邦分析法的描述正确的是", "answer": [0, 1, 2, 3]},
        {"question": "企业确认坏账损失的会计分录涉及到的会计科目有", "answer": [1, 2]},
        {"question": "某公司是一般纳税人，从胜利工厂购入甲材料100吨，每吨不含税价格2000元，增值税税率13%，全部款项以开出并承兑的商业汇票支付，材料尚未到达。该业务会计分录涉及到的会计科目有", "answer": [0, 1, 3]},
        {"question": "营业收入毛利率＝（营业收入－营业成本）÷营业收入×100％", "answer": [0]},
        {"question": "杜邦分析法是一种用来评价公司赢利能力和股东权益回报水平，从财务角度评价企业绩效的一种经典方法。其基本思想是将企业净资产收益率逐级分解为多项财务比率乘积，这样有助于深入分析比较企业经营业绩。由于这种分析方法最早由美国杜邦公司使用，故名杜邦分析法", "answer": [0]},
        {"question": "每股收益，又称每股税后利润、每股盈余，指税后利润与股本总数的比率，即公司某一时期净收益与股份数的比率", "answer": [0]},
        {"question": "关于编制银行存款余额调节表的作用表述不准确的是", "answer": [2]},
        {"question": "在采用借贷记账法时，登记在账户贷方", "answer": [2]},
        {"question": "企业应当以为会计确认、计量和报告的基础", "answer": [0]},
        {"question": "下列关于所有者权益内容描述不正确的是", "answer": [0]},
        {"question": "所有者权益的来源不包括", "answer": [3]},
        {"question": "正确的基本每股收益计算公式是", "answer": [0]},
        {"question": "企业开出的商业承兑汇票到期无力支付时，应该贷记科目", "answer": [3]},
        {"question": "企业偿还应付账款时，应该借记科目", "answer": [3]},
        {"question": "下列不属于营业外支出的是", "answer": [3]},
        {"question": "企业资金运动的过程包括", "answer": [0, 1, 2, 3]},
        {"question": "下列属于负债类会计科目的是", "answer": [0, 1, 2, 3]},
        {"question": "长期金融负债包括", "answer": [0, 1, 3]},
        {"question": "企业确认坏账损失的会计分录涉及到的会计科目有", "answer": [1, 2]},
        {"question": "企业开出的商业承兑汇票到期无力支付时，应该做一个结转的会计分录，涉及到的会计科目是", "answer": [1, 3]},
        {"question": "从本质上看，会计是一种讲求经济效益的管理活动", "answer": [0]},
        {"question": "利润是指企业在一定会计期间的经营成果,包括收入减去费用后的净额、直接计入当期利润的利得和损失等", "answer": [0]},
        {"question": "背书，指收款人以转让票据权利为目的在汇票的背面签章并作必要的记载所作的一种票据行为。商业汇票持票人将票据权利转让给他人或者将一定的票据权利授予他人行使时就必须以背书的形式来进行", "answer": [0]},
        {"question": "从外单位取得的原始凭证如有遗失，应当取得原开出单位盖有公章的证明，并注明原来凭证的号码、金额和内容等，由经办单位会计机构负责人、会计主管人员和单位领导人批准后，才能代作原始凭证", "answer": [0]},
        {"question": "会计的核算职能，是指会计以货币为主要计量单位，对特定主体的经济活动进行确认、计量和报告", "answer": [0]},
        {"question": "以下关于股票流通市场组织形式的说法，不正确的是", "answer": [2]},
        {"question": "以下不属于按交易对象划分的金融市场的是", "answer": [3]},
        {"question": "在发行制度下，证券监管机构不对证券发行行为及证券本身作出价值判断，对公开资料的审查只涉及形式，不涉及任何发行实质条件", "answer": [1]},
        {"question": "与其他金融交易相比，保险的交易特征不包括", "answer": [3]},
        {"question": "下列不是风险投资的特征", "answer": [2]},
        {"question": "保险公司经营活动的目的是追求，这使得保险公司有必要积极开展投资活动", "answer": [1]},
        {"question": "以下关于证券投资基金发行的说法，不正确的是", "answer": [1]},
        {"question": "下列不属于金融资产的是", "answer": [2]},
        {"question": "同其他货币市场信用工具相比，国库券市场的特征是", "answer": [0, 1, 3]},
        {"question": "资产证券化通常具有的三个基本特征是", "answer": [0, 1, 3]},
        {"question": "资产证券化中的资产往往是流动性较好的资产，通过资产证券化将其转化成流动性更强的资产是其动力来源和显著特征", "answer": [1]},
        {"question": "金融衍生工具市场的交易组织方式主要为场内交易和场外交易", "answer": [0]},
        {"question": "股票价格指数期货同其他各种期货一样，兼有套期保值和投机的功能", "answer": [0]},
        {"question": "资本市场中的股票、债券和证券投资基金都是一种直接的证券投资方式", "answer": [1]},
        {"question": "在债券市场上，相对于其他条件相同的债券，国债的价格一般要低于金融债券", "answer": [1]},
        {"question": "期限性、收益性、流动性和安全性是金融工具的重要特性", "answer": [0]},
        {"question": "下列是投资基金市场上的自律组织", "answer": [1]},
        {"question": "下列是外汇市场客户", "answer": [3]},
        {"question": "以下关于金融衍生工具市场的说法，不正确的是", "answer": [1]},
        {"question": "以下不属于技术分析的方法的是", "answer": [3]},
        {"question": "金融市场通过为政府的宏观经济政策的实施提供传导途径，创造良好条件，体现了金融市场在宏观经济中的功能", "answer": [3]},
        {"question": "风险投资一般将投资重点放在企业", "answer": [3]},
        {"question": "传统意义上的金融风险主要是指", "answer": [1]},
        {"question": "以下关于保险市场需求的影响因素的说法，不正确的是", "answer": [0]},
        {"question": "货币市场最为显著的特点是", "answer": [0]},
        {"question": "金融衍生工具的特征主要有", "answer": [2, 3]},
        {"question": "资产证券化中的资产往往是流动性较好的资产，通过资产证券化将其转化成流动性更强的资产是其动力来源和显著特征", "answer": [1]},
        {"question": "一般来讲，股票价格是与经济增长同方向运动的", "answer": [0]},
        {"question": "收益率曲线是分析利率走势和进行市场定价的基本工具，也是进行投资的重要依据", "answer": [0]},
        {"question": "金融衍生工具市场有三类交易主体：套期保值者、投机者和套利者", "answer": [1]},
        {"question": "资产证券化以公司的产权为清偿基础，偿付以公司的全部法定资产为界", "answer": [1]},
        {"question": "单利的计算方法反映利息的本质特征，是更符合生活实际的利息计算观念", "answer": [1]},
        {"question": "20世纪70年代，新古典宏观经济学、货币主义和供给学派为代表的自由主义理论和思想复兴，构成金融监管理论变革中的基础", "answer": [2]},
        {"question": "以下关于保险市场需求的影响因素的说法，不正确的是", "answer": [0]},
        {"question": "以下不属于技术分析的方法的是", "answer": [3]},
        {"question": "目前，我国的基金管理费、基金托管费及基金销售服务费均是按前一日基金资产净值的一定比例逐日计提，按支付", "answer": [2]},
        {"question": "以下关于债券基本要素的说法，不正确的是", "answer": [0]},
        {"question": "以下关于股票流通市场组织形式的说法，不正确的是", "answer": [2]},
        {"question": "下列是投资基金市场上的自律组织", "answer": [1]},
        {"question": "货币市场包括", "answer": [0, 1, 2]},
        {"question": "收益率曲线是分析利率走势和进行市场定价的基本工具，也是进行投资的重要依据", "answer": [0]},
        {"question": "退出机制不仅是风险资本的变现器，也是实现保值增值的手段", "answer": [0]},
        {"question": "金融市场监管的目标有一般目标和具体目标之分，一般目标就是要保护公众利益", "answer": [1]},
        {"question": "竞价买卖是证券交易所中买卖股票的主要方式", "answer": [0]},
        {"question": "中央银行通过货币市场进行公开市场操作，可以有效避免货币政策实施过程中的金融震荡", "answer": [0]},
        {"question": "买卖差价较小的债券的流动性比较高；反之，流动性较低", "answer": [0]},
        {"question": "基金同业协会是投资基金市场监管机构", "answer": [1]},
        {"question": "根据保险业务的承保程序划分，保险市场可以分为原保险市场和", "answer": [2]},
        {"question": "按是否在股票票面上标明金额，股票可以分为", "answer": [2]},
        {"question": "下列不是风险投资的特征", "answer": [2]},
        {"question": "以下不属于金融市场的宏观经济功能的是", "answer": [3]},
        {"question": "以下关于证券投资基金发行的说法，不正确的是", "answer": [1]},
        {"question": "在一个有效的金融市场上，金融资产的价格和资金的利率能及时、准确、全面地反映所有，资金在价格信号的引导下迅速、合理地流动", "answer": [0]},
        {"question": "按照，可将汇率划分为即期汇率和远期汇率", "answer": [3]},
        {"question": "在外汇市场上，利率高的货币，其远期汇率表现为", "answer": [1]},
        {"question": "风险投资的功能有", "answer": [0, 1, 2, 3]},
        {"question": "资产证券化中的资产往往是流动性较好的资产，通过资产证券化将其转化成流动性更强的资产是其动力来源和显著特征", "answer": [1]},
        {"question": "金融市场的分配功能主要表现在资源的配置和财富的再分配方面", "answer": [1]},
        {"question": "期限性、收益性、流动性和安全性是金融工具的重要特性", "answer": [0]},
        {"question": "对于债券收益率的衡量只有到期收益率", "answer": [1]},
        {"question": "中央银行通过货币市场进行公开市场操作，可以有效避免货币政策实施过程中的金融震荡", "answer": [0]},
        {"question": "在即期汇率一定的情况下，远期汇率水平主要决定于升水或贴水水平", "answer": [0]},
        {"question": "金融市场风险的基础原因是金融价格因子不稳定而引起的金融资产价值减少。基础性金融市场因子有利率、汇率、股票价格和商品价格等", "answer": [0]},
        {"question": "现钞本身没有标明其收益率的高低，不能给持有者带来收益", "answer": [1]},
        {"question": "在微机的配置中常看到P4 2.4G字样，其中数字2.4G表示", "answer": [0]},
        {"question": "一个汉字的机内码与国标码之间的区别是", "answer": [0]},
        {"question": "用于汉字信息处理系统之间或者与通信系统之间进行信息交换的汉字代码是", "answer": [0]},
        {"question": "计算机操作系统通常具有的5大功能是", "answer": [2]},
        {"question": "影响一台计算机性能的关键部件是", "answer": [2]},
        {"question": "在计算机硬件技术指标中，度量存储器空间大小的基本单位是", "answer": [0]},
        {"question": "一个汉字的内码与它的国标码之间的差值是多少", "answer": [2]},
        {"question": "已知英文字母“m”的ASCII码值为109 ，那么英文字母“p”的ASCII码值是", "answer": [0]},
        {"question": "USB 1.1和USB 2.0的区别之一在于传输率不同，USB 1.1的传输率是", "answer": [1]},
        {"question": "计算机按性能可以分为超级计算机、大型计算机、小型计算机、微型计算机和", "answer": [2]},
        {"question": "下列设备组中，完全属于输入设备的一组是", "answer": [2]},
        {"question": "汉字区位码分别用十进制的区号和位号进行表示，那么关于区号和位号，他们的的范围分别是", "answer": [2]},
        {"question": "若已知一汉字的国标码是5E38H，那么它的内码是", "answer": [0]},
        {"question": "一个完整计算机系统的组成部分应该是", "answer": [3]},
        {"question": "鼠标器不能作为微机输出设备", "answer": [0]},
        {"question": "MSOffice是操作系统", "answer": [1]},
        {"question": "一台微机性能的好坏，主要取决于显示器的分辨率高低", "answer": [1]},
        {"question": "目前主要应用于银行、税务、商店等的票据打印的打印机是针式打印机", "answer": [0]},
        {"question": "多媒体技术的主要特点是分布性和交互性", "answer": [1]},
        {"question": "文字处理系统不属于多媒体系统", "answer": [0]},
        {"question": "多媒体信息包括文字、图形", "answer": [0]},
        {"question": "外存储器用来存放“暂时不用”的程序和数据，容量要比内存大得多", "answer": [0]},
        {"question": "自然码汉字输入法的编码属于音形码", "answer": [0]},
        {"question": "用户在ISP注册拨号入网后，其电子邮箱应该建立在ISP的邮件服务器上", "answer": [0]},
        {"question": "Word 2010处理的文档内容输出时与页面显示模式显示的", "answer": [1]},
        {"question": "哪些组合键可以在Word 2010文档中插入一个硬分页符", "answer": [0]},
        {"question": "如果要复制字段格式而不复制字码，需用按钮", "answer": [1]},
        {"question": "标记包含前面文字格式信息", "answer": [1]},
        {"question": "使用Word 2010软件时，插入分页符，需要使用的菜单命令是", "answer": [2]},
        {"question": "在Word 2010软件处理时，有的命令后面带有一个省略号“…”，当此命令执行后将显示在屏幕上", "answer": [3]},
        {"question": "Word 2010软件主要处理是", "answer": [1]},
        {"question": "在Word 2010使用过程中，如果要输入希腊字母Ω，则需要使用菜单", "answer": [1]},
        {"question": "在使用Word 2010的编辑功能时，要指定文件里保存一个之前编辑好的文档，正确的操作方法是", "answer": [1]},
        {"question": "设置字符格式需要", "answer": [0]},
        {"question": "输入文档时，键入的内容出现在", "answer": [3]},
        {"question": "在Word 2010中插入脚注、尾注时，最好使当前视图为", "answer": [2]},
        {"question": "若要在Word处理软件的主页中，显示常用工具按钮，需要使用", "answer": [1]},
        {"question": "关闭当前文档的快捷键是", "answer": [1]},
        {"question": "在Word 2010进行编辑时，有时候红色的波浪线会出现在英文的下方，这是", "answer": [1]},
        {"question": "在Word软件运行时，若要将第一自然段复制到文件的最后，需要进行的操作是[复制]、[粘贴", "answer": [0]},
        {"question": "在Word2010中，如果要将已被选定的文本设置为斜体，快捷键是“Ctrl+I”", "answer": [0]},
        {"question": "在Word2010中，要打印文档1，2，3，5，10页，需要在打印对话框中输入：1-10", "answer": [1]},
        {"question": "在Word的编辑状态，打开文档AAdoc，修改后另存为BBdoc，则BBdoc是当前文档", "answer": [0]},
        {"question": "在Word编辑状态，先后打开了d1.doc文档和d2.doc文档，则只能显现d2.doc文档的窗口", "answer": [0]},
        {"question": "在Word编辑状态，进行打印操作，应当使用的菜单是“文件”菜单", "answer": [0]},
        {"question": "在word被使用的过程中，下拉列表的操作可以通过单击显示比例中的按钮来实现", "answer": [0]},
        {"question": "在word中，要想文件可以让他人浏览但不能修改，可以在“工具”菜单下的“选项”中设置修改权限口令", "answer": [0]},
        {"question": "在Word字处理软件中，光标和鼠标的位置是光标代表当前文字输入的位置，而鼠标则可以用来确定光标的位置", "answer": [0]},
        {"question": "在Word环境下，在删除文本框时文本框边线和文本都删除", "answer": [0]},
        {"question": "执行菜单命令每次可以插入个工作表", "answer": [0]},
        {"question": "在Excel中，A3单元格的含义是", "answer": [1]},
        {"question": "在Excel中创建图表，最常用的方法是用", "answer": [1]},
        {"question": "Excel 2010中，如果给某单元格设置的小数位数为2，则输入100时显示", "answer": [0]},
        {"question": "用户输入到工作表单元格中的数据可以分为两大类", "answer": [0]},
        {"question": "Excel2010表示的数据库文件中最多可以保存条记录", "answer": [3]},
        {"question": "在Excel2010的单元格中输入数据，默认的对齐方式是", "answer": [0]},
        {"question": "在Excel 2010使用时，要进行分类汇总，需要对数据清单进行操作", "answer": [1]},
        {"question": "Office 是一种常用的办公软件，是由公司开发的软件", "answer": [1]},
        {"question": "在同一个工作簿中区分不同工作表的单元格，要在地址前面增加来标识", "answer": [2]},
        {"question": "Excel中有多个常用的简单函数，其中函数AVERAGE(区域)的功能是", "answer": [1]},
        {"question": "当前工作表的第7行、第4列，其单元格地址为", "answer": [1]},
        {"question": "在Excel中函数MIN(10，7，12，0)的返回值是", "answer": [3]},
        {"question": "在Excel 2010中，Average函数的功能是", "answer": [3]},
        {"question": "在单元格输入，该单元格会显示0.3", "answer": [1]},
        {"question": "Excel被使用的过程中，工作表的自动筛选被取消后，工作表恢复原样", "answer": [0]},
        {"question": "在Excel2010中在一个单元格中输入数据为1.678E+05，它与1.6785相等", "answer": [1]},
        {"question": "在Excel2010中，电子工作表中的列标为字母", "answer": [0]},
        {"question": "用户在Excel中要将光标直接定位到A1，可以按Ctrl+Home", "answer": [0]},
        {"question": "在Excel2010的操作界面中，整个编辑栏被分为左、中、右三个部分，左面部分显示出活动单元格的列标", "answer": [1]},
        {"question": "如果想插入一条水平分页符，活动单元格应放在第一行A1单元格以外的其他单元格", "answer": [1]},
        {"question": "Excel广泛应用于统计分析，财务管理分析，股票分析和经济，行政管理等各方面", "answer": [0]},
        {"question": "在Excel2010中，假定一个单元格的地址为D25，则该单元格的地址为相对地址", "answer": [0]},
        {"question": "在Excel2010的工作表中，行和列只能隐藏行不能隐藏列", "answer": [1]},
        {"question": "Excel2010中，若在工作表中插入一列，则一般插在当前列的左侧", "answer": [0]}

    ]
    var sets = setInterval(function() {
        if (typeof Cookies != 'undefined' && typeof $ != 'undefined') {
            console.log("依赖项加载成功");
            clearInterval(sets)
            var links = window.location.href
            if (links.includes("mystudy.html")) {} else if (links.includes("courseDetails.html")) {
                //课程详情
                akk()
            } else if (links.includes("cwVideoPlay.html")) {
                //课程学习
                ssp()
            } else if (links.includes("cwPDF.html") || links.includes("viewer.html")) {
                //pdf阅读
                pdf()
            } else if (links.includes("cwExercise.html") || links.includes("cwExerciseResult.html") || links.includes("cwExercisePaser.html")) { // 答题页面
                dts()
            }
            if (
                links.includes("cwQa.html") ||
                links.includes("cwExam.html")) {
                next_page()
            }
        } else {
            console.log("加载依赖中");
        }
    }, 500)

    //课程介绍
    function akk() {
        console.log("课程介绍");
        var cok = Cookies.get('kc_num')
        var but = $("[class='button primary']").eq(0).text()
        if (but != "重新学习") {
            $("[class='button primary']").eq(0)[0].click()
        } else {
            console.log("此课程已学习完成");
            Cookies.set('kc', cok)
            $("#mystudy")[0].click();
        }
    }
    //pdf文案
    function pdf() {
        console.log("pad页面");
        setInterval(function() {
            console.log("滚动中");
            $("[class='w h']").contents().find("#viewerContainer").scrollTop(99999999999)
            if ($(".tsuccess").text() !== "") {
                console.log("已学习");
                next_page()
            }
        }, 1000)
    }
    //视频
    function ssp() {
        var myVid = document.getElementById("myPlayer_html5_api");
        // document.querySelector("video").src="https://vod.300hu.com/4c1f7a6atransbjngwcloud1oss/5d82e52a382171174942019585/v.f30.mp4"
        document.querySelector("video").playbackRate = 3.5; // 锁定播放速度在倍
        myVid.volume = 0;
        $(".vjs-big-play-button").click()
        var timesRun = 0;//5分钟刷新下界面
        setInterval(function() {
            console.log("监听中："+timesRun);
            if ($(".video-js").hasClass("vjs-paused")) {
                $(".vjs-big-play-button").click()
            }
            if ($(".tsuccess").text() !== "") {
                console.log("已学习");
                next_page()
            }
        }, 1000)
        myVid.addEventListener('pause', function() { //暂停开始执行的函数
            console.log("播放a");
            myVid.play()
        });
    }


    // 答题
    function next_page() {
        console.log("下一课");
        setInterval(function() {
                if ($(".tree-content div").length > 0) {
                for (var i = 0; i < $(".tree-content div").length; i++) {
                    if ($(".tree-content div:eq(" + i + ") [class='status fail']").length !== 0 && ($(".tree-content div:eq(" + i + ") [class='col v-m icon'] img").attr("src") === "../img/video.png" || $(".tree-content div:eq(" + i + ") [class='col v-m icon'] img").attr("src") === "../img/PDF.png")) {
                        $(".tree-content div:eq(" + i + ") a")[0].click();
                        break
                    }
                }
            }
        }, 1000)
    }


    function kksa(json_answer) {
        var i = 0
        var m = 0
        var times
        console.log("答题模块")

        // if (!localStorage.getItem("question_list")) {
        // console.log("获取答案")
        // Cookies.set('dn', 1)
        // commitExercise()
        // } else {
        setInterval(function() {
            if ($(".exam-num").eq(i).hasClass("finish")) {
                console.log("下一题")
                clearInterval(times)
                $("[class='button primary outline w']:eq(1)")[0].click();
                i++
                setTimeout(function() {
                    document.querySelectorAll("input").forEach((el, index) => {
                        el.checked = false
                    })
                }, 500)
                setTimeout(function() {
                    cels()
                }, 800)
            }
        }, 1000)
        // }

        function cels() {
            if ($(".exam-card .grid-item").length > i) {
                let noAnser = true
                for (let j = 0; j < json_answer.length; j++) {
                    var question = $(".exam dt").text().substr($(".exam dt").text().indexOf("、") + 1);
                    var answerQue =json_answer[j].question;
                    console.log("题目: "+question);
                    console.log("题目是否匹配: "+question.includes(answerQue));
                    if (question.includes(json_answer[j].question)) {
                        noAnser = false;
                        tempFun(j)
                        function tempFun(l) {
                            // setTimeout(function() {
                            console.log("找到答案", i, json_answer[l]);
                            if (json_answer[l].answer) {
                                for (var k = 0; k < json_answer[l].answer.length; k++) {
                                    $(".exam .item:eq(" + json_answer[l].answer[k] + ") input").click()
                                }
                            } else {
                                let noAnw = true
                                document.querySelectorAll(".exam .item").forEach((el, index) => {
                                    noAnw=false;
                                    // console.log("学习内容", json_answer[l].qsd[0], el.innerText.substring(2), json_answer[l].qsd.indexOf(el.innerText.substring(2)))
                                    if (json_answer[l].qsd.indexOf(el.innerText.substring(2)) !== -1) {
                                        console.log("答案", json_answer[l].qsd[json_answer[l].qsd.indexOf(el.innerText.substring(2))])
                                        console.log(el)
                                        if (!$(el).find("input")[0].checked) {
                                            $(el).find("input").click()
                                        }
                                    }

                                        if (noAnw) {
                                            console.log("没有找到这道题的答案", i);
                                            $(".exam .item:eq(0) input").click()
                                        }
                                }

                                )
                            }
                            // }, 1000)
                        }
                    }else{
                        console.log("题目: "+question);
                        console.log("答案题目未匹配上:"+answerQue);
                    }
                }
                if (noAnser) {
                    console.log("没有找到这道题的答案", i);
                    $(".exam .item:eq(0) input").click()
                }
            } else {
                console.log("答题完成");
                Cookies.set('dn', 1)
                commitExercise()
            }
        }
        cels()
        // let mat_dt = setInterval(function() {
        //     if ($(".exam-card .grid-item").length > i) {
        //         // $(".exam .item:eq(0) input").click()
        //         for (var j = 0; j < json_answer.length; j++) {
        //             if ($(".exam dt").text().substr($(".exam dt").text().indexOf("、") + 1).includes(json_answer[j].question)) {
        //                 console.log("找到答案");
        //                 console.log(json_answer[j]);
        //                 $(".exam .item:eq(0) input").click()
        //                 for (var k = 0; k < json_answer[j].answer.length; k++) {
        //                     $(".exam .item:eq(" + json_answer[j].answer[k] + ") input").click()
        //                 }
        //             }
        //         }
        //         if ($(".exam-num").eq(i).hasClass("finish")) {
        //             $("[class='button primary outline w']:eq(1)")[0].click();
        //             i++
        //             m = 0
        //         }
        //         // 网络问题超时强制跳过
        //         if (m >= 10) {
        //             $("[class='button primary outline w']:eq(1)")[0].click();
        //             i++
        //             m = 0
        //         }
        //         m++
        //     } else {
        //         console.log("答题完成");
        //         Cookies.set('dn', 1)
        //         commitExercise()
        //         clearInterval(mat_dt)
        //     }
        // }, 1000)
    }

    function dts() {
        var da = Cookies.get('dn')
        if (da == undefined) {
            console.log("一阶段,随机填写答案");
            localStorage.clear();
            let check = setInterval(function() {
                if ($(".exam-card .grid-item").length !== 0) {
                    // 防止卡机
                    var nookkd = true
                    $("[class='button primary outline w']").each(function(index, el) {
                        nookkd = !nookkd
                        if ($(el).text() === "再做一次") $(el)[0].click();
                    })
                    if (nookkd) {
                        kksa(tks)
                    }
                    clearInterval(check)
                }
            }, 100)
            } else if (da === "1") {
                console.log("二阶段,查看正确答案/查看是否通过");
                let await_ajax = setInterval(function() {
                    $("h2").each((index, el) => {
                        // 如果已经通过
                        if ($(el).text().includes("测试通过")) {
                            console.log("通过测试");
                            Cookies.remove('dn')
                            Cookies.remove('question_list')
                            Cookies.remove('isokk')
                            next_page()
                            clearInterval(await_ajax)
                        } else if ($(el).text().includes("您未能通过测试")) {
                            console.log("没有通过");
                            var on_ok = true
                            $("[class='button primary outline w']").each(function(index, el) {
                                Cookies.set('dn', 2)
                                if ($(el).text() === "查看解析") {
                                    on_ok = false
                                    $(el)[0].click()
                                };
                                clearInterval(await_ajax)
                            })
                            if (on_ok) {
                                Cookies.remove('dn')
                                Cookies.remove('question_list')
                                Cookies.remove('isokk')
                                next_page()
                                clearInterval(await_ajax)
                            }
                        }
                    })
                }, 100)
                } else if (da === "2") {
                    console.log("三阶段,将答案写入cookie");
                    let await_ajax = setInterval(function() {
                        if ($(".exam-card .grid-item").length !== 0) {
                            kksas()
                            clearInterval(await_ajax)
                        }
                    }, 100)

                    function kksas() {
                        var i = 0;
                        var temp_arr = JSON.parse(localStorage.getItem("question_list")) || []
                        let await_get_qus = setInterval(function() {
                            if (i < $(".exam-card .grid-item").length) {
                                var ans = $(".jiexi .content p:last-child").text().substring(5).split("")
                                var ten = []
                                var answ =[]
                                for (var s = 0; s < ans.length; s++) {
                                    ans[s] = ans[s].charCodeAt() - 65
                                }
                                for (var p = 0; p < ans.length; p++) {
                                    ten.push(document.querySelectorAll(".exam .item")[ans[p]].innerText.substring(2))
                                    answ.push(document.querySelectorAll(".exam .item")[ans[p]].innerText.substring(0))
                                    console.log("题目 :"+$(".exam dt").text().substr(1)+"  答案 ："+document.querySelectorAll(".exam .item")[ans[p]].innerText.substring(0))
                                }

                                temp_arr.push({ "question": $(".exam dt").text().substr(3), "qsd": ten })
                                $("[class='button primary outline w']").eq(1)[0].click();
                                i++
                            } else {
                                localStorage.setItem("question_list", JSON.stringify(temp_arr));
                                console.log("localStorage值"+localStorage.getItem("question_list"))
                                Cookies.set('question_list', temp_arr)
                                Cookies.set('dn', 3)
                                clearInterval(await_get_qus)
                                console.log(temp_arr)
                                $("[class='row w current'] [class='col v-m oneline']").click()
                            }
                        }, 100)

                        }
                } else if (da === "3") {
                    console.log("回填");
                    Cookies.set('dn', 4)
                    setInterval(function() {
                        $("[class='button primary outline w']").each(function(index, el) {
                            if ($(el).text() === "再做一次") $(el)[0].click();
                        });
                    }, 300)
                } else if (da === "4") {
                    // var dnlb = JSON.parse(Cookies.get('question_list'))
                    var dnlb = JSON.parse(localStorage.getItem("question_list"));
                    console.log(dnlb);
                    var i = 0
                    let check = setInterval(function() {
                        if ($(".exam-card .grid-item").length !== 0) {
                            Cookies.set('isokk', "ok")
                            // 防止卡机
                            var nookkd = true
                            $("[class='button primary outline w']").each(function(index, el) {
                                nookkd = !nookkd
                                if ($(el).text() === "再做一次") $(el)[0].click();
                            })
                            if (nookkd) {
                                kksa(dnlb)
                            }
                            clearInterval(check)
                        }
                    }, 100)
                    }
    }
})();